'''6) კომენტარების სახით ახსენით რა არის array და def'''

# array - მასივი მონაცემთა სტრუქტურა ( სიის მსგავსი ) განმასხვავებელი ნაწილები არის მეთოდები, extend, insert, reverse სამივე მათგანს აქვს სხვადასხვა დანიშნულება.
# extend - აერთიანებს სიაში ელემენტებს.
# insert - სვავს ელემენტს საიში პირველი პარამეტრი, არის რომელ ინდექსზე ჩაჯდეს, და მეორე პარამეტრი კი რა ჩაჯდეს.
# reverse - აბრუნებს სიას საპირისპირო მიმართულებით Input: --> [1,2,3] Output: --> [3,2,1]

# def - ეს სიტყვა განსაზღვრავს ფუნქციას მანამ სანამ ფუნქციას, სახელს დავარქმევთ ფუნქცია უკვე შექმნილია def ის გრძელი ფორმა define ანუ განსაზღვრა / შექმნა სწორედ ამას აკეთებს ეს სიტყვა. იგივე keyword
# def არის ფუნქციის შემქმნელი / შემადგენელი ნაწილი და გამოიყენება ფუნქციის დასაწერად. მას ფუნქციის შემდეგ შეუძლია მიიღოს მრავალი არგუმენტი, მრავალი ფუნქცია, ორ რიცხვს შორის გამოთვლა ( ჯამი ) შეკრება, გამოკლება, გამრავლება, აკვადრატება, f-string ის ფუნქცია, input, variable და მრავალი სხვა რამ.
# def ს მოჰყვება, ფუნქციის სახელი და ფრჩხილები def addition()